Documents/_Инвойс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>_Инвойс</Name>
			<BasedOn>
				<xr:Item>Document.ИнвойсЗакупки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтправкаИнвойсов</xr:Item>
				<xr:Item>AccumulationRegister._ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоИнвойсам</xr:Item>
				<xr:Item>InformationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ОприходованиеНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВДороге</xr:Item>
				<xr:Item>AccumulationRegister.СкорректированныеИнвойсы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДокументСкидки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВКД_СкидкаПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаЗакупкиСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Распределить</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_НомерИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДатаИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоставок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВВалютеИнвойса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацииИнвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВКД_Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупкиСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаИнвойса</Name>
							<Comment>Цена в валюте инвойса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНаценкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Поставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/НазначениеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>НазначениеФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыИнвойса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>СтатусыИнвойса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОтправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноПрибыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прибыл</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/_Инвойс/Forms/ФормаСписка/Ext/Form/Module.bsl
// © Primus1C  26.06.2023  НАЧАЛО ►

#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяДокумента = "Инвойс";

	гоСтандартныйОтборПоПолю("Контрагенты", Список, "Контрагент");
	
	глПокраситьВалюты(ЭтаФорма, "Валюта");  
	//глПокраситьСтатусы(ЭтаФорма, "Список", Истина, Ложь, Ложь);  
	лРаскраскаСтатусов =  ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьСтатусыВФормеСписка");
	глПокраситьСтатусы(ЭтаФорма, "Список", лРаскраскаСтатусов, , лРаскраскаСтатусов);  
    //глПокраситьПомеченныеНаУдаление(ЭтаФорма);
	глУстановитьГраницуВидимости(Список);
	
	Если Элементы.Найти("КоличествоСообщений") <> Неопределено Тогда
		Элементы.КоличествоСообщений.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСообщения");
	КонецЕсли;
	
    Элементы.Примечание.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьПримечаниеТекущегоДокументаВнизуСписка");
	
	СтруктураПечатныхФорм = Документы._Инвойс.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Ложь, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	

КонецПроцедуры
	
#КонецОбласти         


#Область ДействияЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "Вложения" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("ВладелецСсылка, НазначениеФайла, ИмяАктивнойГиперссылки, ДобавлениеФайла", 
									СтруктураОснования(ВыбраннаяСтрока).Владелец, 
									ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"),
									"Файл_П0",
									Неопределено);
		ОткрытьФорму("Обработка.Предпросмотр.Форма.ФормаПредпросмотра", ПараметрыФормы, ЭтаФорма,,,, );
	Иначе		
	
	КонецЕсли;

КонецПроцедуры

//&НаКлиенте
//Процедура ВывестиПримечание(Команда)  
//	
//	Элементы.Примечание.Видимость 	= ОтображатьПримечание;
//	ОтображатьПримечание 			= НЕ ОтображатьПримечание; 
//	
//КонецПроцедуры

#КонецОбласти  


&НаСервереБезКонтекста
Функция СтруктураОснования(ИнвойсСсылка)
	
	лОснование = ИнвойсСсылка.ДокументОснование;
	Возврат Новый Структура("ОбъектУИД,Владелец", лОснование.УникальныйИдентификатор(), лОснование);	

КонецФункции 

&НаСервере
Процедура УстановитьСтатусНаСервере(ИнвойсСсылка, НовСтатус)

	ОбщегоНазначенияСервер.ЗаписатьСтатусыИнвойса(ИнвойсСсылка, НовСтатус, , , , "Форма списка");

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатус(Команда) 

	Спис = Новый СписокЗначений;
	Спис.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыИнвойса.ВПути"),,,БиблиотекаКартинок.ИндикаторЖелтый16);
	Спис.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыИнвойса.ЧастичноПрибыл"),,,БиблиотекаКартинок.ИндикаторЖелтый16);
	Спис.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыИнвойса.Прибыл"),,,БиблиотекаКартинок.ИндикаторЗеленый16);
	ВыбСтатус = ВыбратьИзМеню(Спис, ЭтаФорма.ТекущийЭлемент);
	Если ВыбСтатус <> Неопределено Тогда
		УстановитьСтатусНаСервере(ЭтаФорма.Элементы.Список.ТекущаяСтрока, ВыбСтатус.Значение); 
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры


#Область ПримечаниеТекущегоДокументаАсихрон

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	//Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
	//	Элементы.Примечание.Заголовок = "";
	//Иначе                                
	//	//	Элементы.Примечание.Заголовок = Примечание(Элементы.Список.ТекущаяСтрока);  // это синхрон
	//	ДопПараметры = Элементы.Список.ТекущаяСтрока;
	//	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучениеДанныхДокументаЗавершение", ЭтотОбъект, ДопПараметры);
	//	НачатьПолучениеДанныхДокумента(ОписаниеОповещения);
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеДанныхДокумента(ОписаниеОповещения) Экспорт

	ВыполнитьОбработкуОповещения(ОписаниеОповещения, Истина);	

КонецПроцедуры

&НаКлиенте
Процедура ПолучениеДанныхДокументаЗавершение(ФормаВызова, ДопПараметры) Экспорт
	
	//Элементы.Примечание.Заголовок = Примечание(ДопПараметры);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Примечание(ДокСсылка)
	
	Возврат ДокСсылка.Примечание;

КонецФункции 

#КонецОбласти



#Область ПодключаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(ТекущийЭлемент.ТекущаяСтрока, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы._Инвойс.ПечатьДокумента(ТекущийЭлемент.ТекущаяСтрока, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти 

// © Primus1C  ОКОНЧАНИЕ ◄
